In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

In [4]:
obj = Series(np.arange(4), index=['a', 'b', 'c', 'd'])

In [5]:
obj['b']

1

In [6]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [7]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [9]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [14]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [15]:
data[data < 5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [16]:
data.loc['Utah']

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [18]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [19]:
data.loc[['Colorado', 'Utah'], ['two', 'three']]

          two  three
Colorado    5      6
Utah        9     10

In [21]:
s1 = Series(np.random.randn(4), index=['a', 'c', 'd', 'e'])

In [22]:
s1

a   -0.482194
c   -0.491563
d    1.430210
e   -0.100398
dtype: float64

In [23]:
s2 = Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [24]:
s2

a   -1.013715
b   -0.596815
c    0.325416
d    0.192959
e   -0.254064
dtype: float64

In [25]:
s1 + s2

a   -1.495909
b         NaN
c   -0.166147
d    1.623170
e   -0.354462
dtype: float64

In [36]:
frame1 = DataFrame(np.arange(9).reshape((3, 3)), columns=list('bcd'), index=['Ohio', 'Texas', 'Colorado'])

In [37]:
frame1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [38]:
frame2 = DataFrame(np.arange(12).reshape((4, 3)), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [39]:
frame2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [42]:
frame1.add(frame2, fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [43]:
arr = np.arange(12).reshape((3,4))

In [44]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [45]:
arr[0]

array([0, 1, 2, 3])

In [46]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [47]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=list('bde'))

In [49]:
series = frame.iloc[0]

In [50]:
series

b    0
d    1
e    2
Name: Ohio, dtype: int64

In [51]:
frame

          b   d   e
Ohio      0   1   2
Colorado  3   4   5
Utah      6   7   8
New York  9  10  11

In [52]:
frame - series

          b  d  e
Ohio      0  0  0
Colorado  3  3  3
Utah      6  6  6
New York  9  9  9

In [53]:
series2 = Series(range(3), index=list('bef'))

In [54]:
series2

b    0
e    1
f    2
dtype: int64

In [56]:
frame + series2

            b   d     e   f
Ohio      0.0 NaN   3.0 NaN
Colorado  3.0 NaN   6.0 NaN
Utah      6.0 NaN   9.0 NaN
New York  9.0 NaN  12.0 NaN

In [60]:
frame.sub(series2)

            b   d     e   f
Ohio      0.0 NaN   1.0 NaN
Colorado  3.0 NaN   4.0 NaN
Utah      6.0 NaN   7.0 NaN
New York  9.0 NaN  10.0 NaN

In [61]:
series3 = frame['d']

In [62]:
series3

Ohio         1
Colorado     4
Utah         7
New York    10
Name: d, dtype: int64

In [63]:
frame

          b   d   e
Ohio      0   1   2
Colorado  3   4   5
Utah      6   7   8
New York  9  10  11

In [64]:
frame.sub(series3, axis=0)

          b  d  e
Ohio     -1  0  1
Colorado -1  0  1
Utah     -1  0  1
New York -1  0  1

In [65]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [66]:
frame

               b         d         e
Utah   -0.364721 -0.215649 -0.864271
Ohio    0.281058 -0.118446  0.165800
Texas  -0.577657 -0.477366 -1.428395
Oregon  2.045838 -0.965665  0.457824

In [67]:
np.abs(frame)

               b         d         e
Utah    0.364721  0.215649  0.864271
Ohio    0.281058  0.118446  0.165800
Texas   0.577657  0.477366  1.428395
Oregon  2.045838  0.965665  0.457824

In [72]:
frame.apply(lambda x: x.max() - x.min())

b    2.623495
d    0.847219
e    1.886219
dtype: float64

In [73]:
frame.apply(lambda x: x.max() - x.min(), axis=1)

Utah      0.648622
Ohio      0.399504
Texas     0.951030
Oregon    3.011503
dtype: float64

In [82]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [81]:
f(np.array([1, 3, 5]))

min    1
max    5
dtype: int64

In [83]:
format = lambda x: '%.2f' % x

In [84]:
frame.applymap(format)

            b      d      e
Utah    -0.36  -0.22  -0.86
Ohio     0.28  -0.12   0.17
Texas   -0.58  -0.48  -1.43
Oregon   2.05  -0.97   0.46

In [85]:
obj = Series(range(4), index=list('dabc'))

In [86]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [87]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [88]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index = ['three', 'one'], columns=['d', 'a', 'b', 'c'])

In [89]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [90]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [92]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [95]:
obj = Series([4, 7, -3, 2])

In [104]:
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

In [105]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [106]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [108]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [109]:
obj = Series([7, -5, 7, 4, 2, 0, 4])

In [110]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [111]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [115]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [118]:
frame.rank(method='max')

     a    b
0  2.0  3.0
1  4.0  4.0
2  2.0  1.0
3  4.0  2.0

In [119]:
obj = Series(np.arange(5), index=['a','a','b', 'b', 'c'])

In [120]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [121]:
obj.index

Index(['a', 'a', 'b', 'b', 'c'], dtype='object')

In [122]:
obj.index.is_unique

False

In [123]:
df = DataFrame(np.random.randn(4,3), index=['a', 'a', 'b', 'b'])

In [124]:
df

          0         1         2
a  0.234236  0.209495  1.442722
a -1.063103  0.135265 -0.710191
b  0.139003 -0.007407  0.484870
b  0.119724  0.718724  0.169330

In [126]:
df.loc['b']

          0         1        2
b  0.139003 -0.007407  0.48487
b  0.119724  0.718724  0.16933

In [127]:
df.sum()

0   -0.570139
1    1.056078
2    1.386731
dtype: float64

In [128]:
df.mean()

0   -0.142535
1    0.264020
2    0.346683
dtype: float64

In [130]:
df.idxmax()

0    a
1    b
2    a
dtype: object

In [131]:
df.describe()

              0         1         2
count  4.000000  4.000000  4.000000
mean  -0.142535  0.264020  0.346683
std    0.615750  0.316217  0.888601
min   -1.063103 -0.007407 -0.710191
25%   -0.175983  0.099597 -0.050550
50%    0.129364  0.172380  0.327100
75%    0.162812  0.336803  0.724333
max    0.234236  0.718724  1.442722

In [134]:
df = DataFrame(np.random.randn(4,3), index=['a', 'b', 'b', 'd'])

In [135]:
df.idxmax()

0    b
1    d
2    b
dtype: object

In [138]:
df[0].idxmax()

'b'

In [139]:
df.max()

0    0.112189
1    0.765997
2    0.152749
dtype: float64

In [140]:
df

          0         1         2
a -1.102932 -0.026828 -1.392433
b -0.263528  0.070254 -0.938263
b  0.112189 -1.232245  0.152749
d -0.867201  0.765997 -0.086113

In [141]:
df.cumsum()

          0         1         2
a -1.102932 -0.026828 -1.392433
b -1.366460  0.043426 -2.330697
b -1.254271 -1.188819 -2.177948
d -2.121471 -0.422822 -2.264061

In [142]:
df.cummin()

          0         1         2
a -1.102932 -0.026828 -1.392433
b -1.102932 -0.026828 -1.392433
b -1.102932 -1.232245 -1.392433
d -1.102932 -1.232245 -1.392433

In [144]:
obj = Series(list('abadfasafdsjklasfsd'))

In [145]:
obj

0     a
1     b
2     a
3     d
4     f
5     a
6     s
7     a
8     f
9     d
10    s
11    j
12    k
13    l
14    a
15    s
16    f
17    s
18    d
dtype: object

In [148]:
obj.unique()

array(['a', 'b', 'd', 'f', 's', 'j', 'k', 'l'], dtype=object)

In [149]:
df.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [150]:
df

          0         1         2
a -1.102932 -0.026828 -1.392433
b -0.263528  0.070254 -0.938263
b  0.112189 -1.232245  0.152749
d -0.867201  0.765997 -0.086113

In [151]:
df.isin([1, 2])

       0      1      2
a  False  False  False
b  False  False  False
b  False  False  False
d  False  False  False

In [152]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4], 'Qu2': [2, 3, 1, 2, 3], 'Qu3': [1, 5, 2, 4, 4]})

In [153]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [154]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [155]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [156]:
df = DataFrame(np.random.randn(7, 3))

In [157]:
df

          0         1         2
0 -0.944295  1.415025  1.326193
1  0.741368 -0.730729 -0.067853
2 -0.947512 -0.488156  0.073348
3  0.775577  0.933425  2.026482
4  0.428204 -0.725486  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [161]:
df.loc[:4, 1] = np.nan

In [162]:
df

          0         1         2
0 -0.944295       NaN  1.326193
1  0.741368       NaN -0.067853
2 -0.947512       NaN  0.073348
3  0.775577       NaN  2.026482
4  0.428204       NaN  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [163]:
df.loc[:2, 2] = np.nan

In [164]:
df

          0         1         2
0 -0.944295       NaN       NaN
1  0.741368       NaN       NaN
2 -0.947512       NaN       NaN
3  0.775577       NaN  2.026482
4  0.428204       NaN  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [165]:
df.dropna(thresh = 3)

          0         1         2
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [166]:
df

          0         1         2
0 -0.944295       NaN       NaN
1  0.741368       NaN       NaN
2 -0.947512       NaN       NaN
3  0.775577       NaN  2.026482
4  0.428204       NaN  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [167]:
df.fillna(0)

          0         1         2
0 -0.944295  0.000000  0.000000
1  0.741368  0.000000  0.000000
2 -0.947512  0.000000  0.000000
3  0.775577  0.000000  2.026482
4  0.428204  0.000000  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [168]:
df

          0         1         2
0 -0.944295       NaN       NaN
1  0.741368       NaN       NaN
2 -0.947512       NaN       NaN
3  0.775577       NaN  2.026482
4  0.428204       NaN  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [171]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0 -0.944295  0.500000 -1.000000
1  0.741368  0.500000 -1.000000
2 -0.947512  0.500000 -1.000000
3  0.775577  0.500000  2.026482
4  0.428204  0.500000  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [172]:
df

          0         1         2
0 -0.944295       NaN       NaN
1  0.741368       NaN       NaN
2 -0.947512       NaN       NaN
3  0.775577       NaN  2.026482
4  0.428204       NaN  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [176]:
df.fillna(method='bfill', limit = 2)

          0         1         2
0 -0.944295       NaN       NaN
1  0.741368       NaN  2.026482
2 -0.947512       NaN  2.026482
3  0.775577 -0.203397  2.026482
4  0.428204 -0.203397  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [177]:
df.mean()

0   -0.172364
1    0.427981
2    0.749189
dtype: float64

In [178]:
df.fillna(df.mean())

          0         1         2
0 -0.944295  0.427981  0.749189
1  0.741368  0.427981  0.749189
2 -0.947512  0.427981  0.749189
3  0.775577  0.427981  2.026482
4  0.428204  0.427981  1.252303
5 -0.833355 -0.203397 -1.226349
6 -0.426535  1.059358  0.944318

In [180]:
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [181]:
data

a  1    0.463291
   2   -0.636144
   3   -2.865127
b  1    0.700610
   2    1.532059
   3   -1.513492
c  1   -1.550098
   2    0.125750
d  2   -0.055566
   3   -0.763682
dtype: float64

In [182]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [183]:
data['b']

1    0.700610
2    1.532059
3   -1.513492
dtype: float64

In [184]:
data.unstack()

          1         2         3
a  0.463291 -0.636144 -2.865127
b  0.700610  1.532059 -1.513492
c -1.550098  0.125750       NaN
d       NaN -0.055566 -0.763682

In [185]:
frame = DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [186]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [189]:
frame.index.names=['key1', 'key2']

In [190]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [191]:
frame.unstack()

      Ohio            Colorado
     Green    Red        Green
key2     1  2   1   2        1   2
key1
a        0  3   1   4        2   5
b        6  9   7  10        8  11

In [192]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [193]:
frame.swaplevel(0, 1)

           Ohio     Colorado
          Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [195]:
frame.sort_index(level=1)

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [196]:
frame.sum(level='key2')

      Ohio     Colorado
     Green Red    Green
key2
1        6   8       10
2       12  14       16

In [197]:
frame.sum(level=1, axis=1)

           Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [199]:
ser3 = Series(np.arange(3), index=[-5, 1, 3])

In [200]:
ser3

-5    0
 1    1
 3    2
dtype: int64

In [206]:
ser3.iloc[2]

2

In [207]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])

In [208]:
frame

   0  1
2  0  1
0  2  3
1  4  5

In [210]:
frame.iloc[:, :1]

   0
2  0
0  2
1  4